{
  "name": "Karel Decherf",
  "contact": {
    "address": "Hurstweg 9, 9000 Gent",
    "email": "karel.decherf@gmail.be",
    "linkedin": "linkedin.com/in/karel-decherf-8212a9221",
    "github": "github.com/KarelTestSpecial"
  },
  "profile": "Gedreven en analytische IT-professional met een levenslange passie voor programmeren en een solide achtergrond in webontwikkeling. Ervaren in een breed scala aan technologieën, waaronder Java, JavaScript, TypeScript, Python en SQL. De continue ontwikkeling en publicatie van diverse projecten, waaronder meerdere Chrome Web Store-extensies en open-source code op GitHub, geven een indruk van mijn actuele vaardigheden. Na een periode van inactiviteit, ben ik dankzij de technologische vooruitgang weer volledig inzetbaar en gemotiveerd om met mijn probleemoplossend vermogen en technische expertise bij te dragen aan een vooruitstrevend team.",
  "notice": "Komt in aanmerking voor werkgeversubsidieregelingen, wat een extra voordeel kan bieden voor werkgevers.",
  "recentProjects": {
    "introduction": "Een selectie van persoonlijke projecten die mijn huidige technische vaardigheden illustreren. Voor een compleet overzicht van al mijn werk, inclusief live demo's en broncode, kunt u mijn portfolio website bezoeken: kareltestspecial.github.io/portfolio/",
    "chromeExtensions": [
      "NotebookLM Source Uploader: Vereenvoudigt het proces voor het uploaden van bronbestanden naar Google's NotebookLM.",
      "Very Practical Clock & Battery Percentage: Lichtgewicht en functionele extensies om de productiviteit en gebruikerservaring te verbeteren.",
      "YouTube Playlist Collector & YouTube Rightclick: Tools om de interactie met YouTube te stroomlijnen en data-export mogelijk te maken."
    ],
    "webApplications": [
      "Link-in-bio-Hub: Een met Firebase gebouwde webapplicatie voor het centraliseren van social media links.",
      "URL-pulse: Een via GitHub Actions geautomatiseerde monitoringtool die de status van URL's controleert en rapporteert.",
      "OCR Combinator: Een tool ontwikkeld om de output van verschillende OCR-diensten te combineren en te verbeteren.",
      "Vegan BioTech Report: Een geautomatiseerd rapport dat data verzamelt en presenteert, draaiend op GitHub Actions."
    ]
  },
  "workExperience": [
    {
      "role": "Andere Functies",
      "company": "Fabrieksarbeider (Pasec), Keukenhulp (Paviljoen C), Klerenhersteller (De Haven), Kok (FPC)",
      "period": "2001 - 2025",
      "description": ""
    },
    {
      "role": "Webontwikkelaar",
      "company": "Visitronics NV, Leuven",
      "period": "01/2001 – 08/2001",
      "description": " Ontwikkelen en onderhouden van webapplicaties op maat voor diverse klanten. Toepassen van een reeks webtechnologieën om te voldoen aan specifieke functionele eisen."
    },
    {
      "role": "Magazijnier",
      "company": "IKEA, Ternat",
      "period": "03/1998 – 01/2001",
      "description": " Verantwoordelijk voor voorraadbeheer en de verwerking van inkomende en uitgaande goederen. Optimaliseren van de magazijnwerking voor maximale efficiëntie."
    }
  ],
  "skills": {
    "ai_tools_automation": "Google Antigravity, Google Jules 2.0, Google Gemini CLI, Google Firebase Studio, Google AI Studio, GitHub SpecKit, GitHub Copilot, OpenAI ChatGPT, Anthropic Claude, Perplexity, Qwen, Manus AI, Genspark, Abacus DeepAgent, Lemon AI, AWS Kiro",
    "full-stack_development": "Java (JSP, Spring Boot, Spring Security (JWT), Spring Data JPA (Hibernate), Maven), JavaScript/TypeScript (Node.js, Express.js, NestJS; React; Vite, Vitest), Python (Django, Flask), PHP (Laravel, FastAPI), Perl, Visual Basic, .NET (ASP.NET Core), IBM RPG, SQL, HTML, CSS, JSON, XML, RESTful API",
    "devops,_cloud_infrastructure": "PostgreSQL, MySQL, SQL Server, Firebase, Supabase, Nginx, Apache, IIS, Git, GitHub Actions (CI/CD), Docker, Google Cloud Platform, Azure",
    "testing_qa": "JUnit 5, Mockito, Spring Boot Test (`@SpringBootTest`), Jest, Vitest, React Testing Library, Cypress, Playwright, Postman",
    "development_tools_software": "VS Code, Cursor, Replit, Microsoft Office, Google Workspace, Odoo, Notion, Bash / PowerShell / Terminal",
    "web_design_graphics": "Figma, Canva, Photoshop, Photopea, WordPress, Wix",
    "operating_systems_networking": "Windows, Linux, ChromeOS, WINS, DHCP, DNS"
  },
  "education": [
    {
      "degree": "Inleiding tot de Psychologie",
      "institution": "Open Universiteit",
      "year": "2012"
    },
    {
      "degree": "Omzetting Industrieel Ingenieur Mechanica (HTL4MMC)",
      "institution": "",
      "year": "2011"
    },
    {
      "degree": "Professionele Bachelor in de Toegepaste Informatica",
      "institution": "GOCI Aarschot",
      "year": "2001"
    },
    {
      "degree": "Kandidatuur Industrieel Ingenieur (1e kand. cum laude)",
      "institution": "KIH De Nayer",
      "year": "1995"
    },
    {
      "degree": "Kandidatuur Filosofie",
      "institution": "KU Leuven",
      "year": "1993 – 1994"
    },
    {
      "degree": "ASO Wetenschappen-Wiskunde (8u Wis.)",
      "institution": "Sint-Godelieve-Instituut Lennik",
      "year": "1993"
    }
  ],
  "languages": [
    {
      "language": "Nederlands",
      "proficiency": "Moedertaal"
    },
    {
      "language": "Engels",
      "proficiency": "Goed"
    },
    {
      "language": "Frans",
      "proficiency": "Goed"
    },
    {
      "language": "Duits en Spaans",
      "proficiency": "Noties"
    }
  ],
  "transport": "Rijbewijs B"
}